Revit 2024 API
WireType.WireMaterial Property
 The material type of the wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireMaterialType WireMaterial { get; set; }
Visual Basic
Public Property WireMaterial As WireMaterialType
	Get
	Set
Visual C++
public:
property WireMaterialType^ WireMaterial {
	WireMaterialType^ get ();
	void set (WireMaterialType^ value);
}
See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace